In [40]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration =  [2,3,6,4]
df = pd.DataFrame(data = {'Course_name' : course_name, 'Duration': duration})

In [8]:
df

        Course_name  Duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [30]:
df[['Course_name','Duration']].T[1]

Course_name    Machine Learning
Duration                      3
Name: 1, dtype: object

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [31]:
df.T[1]

Course_name    Machine Learning
Duration                      3
Name: 1, dtype: object

In [35]:
df.loc[1]

Course_name    Machine Learning
Duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

loc is used to access specific values or slices based on labels, while iloc is used to access values or slices based on integer positions.

In [36]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}, index=['x', 'y', 'z'])

# Accessing data using loc
print(df.loc['x', 'A'])        
print(df.loc[['x', 'y'], 'B'])

# Accessing data using iloc
print(df.iloc[0, 1])        
print(df.iloc[0:2, 1])

1
x    4
y    5
Name: B, dtype: int64
4
x    4
y    5
Name: B, dtype: int64

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df 
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [47]:
new_df=df.reindex(labels=[3,0,1,2])

In [48]:
new_df

        Course_name  Duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [49]:
new_df.loc[2]

Course_name    Big Data
Duration              6
Name: 2, dtype: object

In [51]:
new_df.iloc[2]

Course_name    Machine Learning
Duration                      3
Name: 1, dtype: object

This difference is occured since loc has taken lable and iloc has taken integer.

In [85]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [86]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.612310  0.962972  0.367436  0.766213  0.430334  0.513966
2  0.591368  0.146635  0.547350  0.472614  0.847605  0.618686
3  0.771696  0.795413  0.966465  0.563336  0.819115  0.906311
4  0.414090  0.271504  0.918908  0.777687  0.185082  0.748988
5  0.861168  0.659166  0.188091  0.374747  0.646746  0.047571
6  0.982446  0.996576  0.902945  0.984013  0.988739  0.473855

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
 (i) mean of each and every column present in the dataframe.
 (ii) standard deviation of column, ‘column_2’

In [87]:
pd.DataFrame(df1.mean())

                 0
column_1  0.705513
column_2  0.638711
column_3  0.648533
column_4  0.656435
column_5  0.652937
column_6  0.551563

In [88]:
df1['column_2'].std()

0.35641712162072536

In [ ]:
Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the 
mean of column, column_2.
 If you are getting errors in executing it then explain why.
 [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [89]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.612310  0.962972  0.367436  0.766213  0.430334  0.513966
2  0.591368  0.146635  0.547350  0.472614  0.847605  0.618686
3  0.771696  0.795413  0.966465  0.563336  0.819115  0.906311
4  0.414090  0.271504  0.918908  0.777687  0.185082  0.748988
5  0.861168  0.659166  0.188091  0.374747  0.646746  0.047571
6  0.982446  0.996576  0.902945  0.984013  0.988739  0.473855

In [90]:
df1.iloc[1]=['a','b','c','d','e','f']

In [91]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1   0.61231  0.962972  0.367436  0.766213  0.430334  0.513966
2         a         b         c         d         e         f
3  0.771696  0.795413  0.966465  0.563336  0.819115  0.906311
4   0.41409  0.271504  0.918908  0.777687  0.185082  0.748988
5  0.861168  0.659166  0.188091  0.374747  0.646746  0.047571
6  0.982446  0.996576  0.902945  0.984013  0.988739  0.473855

In [92]:
df1.mean()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_11660\2053335143.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

Series([], dtype: float64)

In [94]:
df1.dtypes

column_1    object
column_2    object
column_3    object
column_4    object
column_5    object
column_6    object
dtype: object

In [95]:
df1.count()

column_1    6
column_2    6
column_3    6
column_4    6
column_5    6
column_6    6
dtype: int64

Since columns contains string also so it is not able to find out the mean of the columns.

In [ ]:
Q6. What do you understand about the windows function in pandas and list the types of windows 
functions?

In pandas, the window functions are used for performing calculations on a specified window of data in a DataFrame or a Series.

The window functions in pandas can be categorized into the following types:
    Aggregation Functions:
    Transformation Functions:
    Rolling and Expanding Functions:
    Window Filtering Functions:
    Window Value Counts:
    Window Aggregations with Custom Functions:

In [100]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})

# Rolling window functions
df['rolling_sum'] = df['A'].rolling(window=3).sum()
df['rolling_mean'] = df['B'].rolling(window=2).mean()

# Expanding window functions
df['expanding_sum'] = df['A'].expanding().sum()
df['expanding_mean'] = df['B'].expanding().mean()

print(df)

   A   B  rolling_sum  rolling_mean  expanding_sum  expanding_mean
0  1   6          NaN           NaN            1.0             6.0
1  2   7          NaN           6.5            3.0             6.5
2  3   8          6.0           7.5            6.0             7.0
3  4   9          9.0           8.5           10.0             7.5
4  5  10         12.0           9.5           15.0             8.0

Q7. Write a code to print only the current month and year at the time of answering this question.

In [111]:
df2=pd.DataFrame({'Date': ['2023-06-27']})

In [112]:
df2

         Date
0  2023-06-27

In [113]:
df2['Updated_date']=pd.to_datetime(df2['Date'])

In [114]:
df2

         Date Updated_date
0  2023-06-27   2023-06-27

In [115]:
df2.dtypes

Date                    object
Updated_date    datetime64[ns]
dtype: object

In [117]:
df2['year'] = df2['Updated_date'].dt.year

In [119]:
df2['month'] = df2['Updated_date'].dt.month

In [120]:
df2

         Date Updated_date  year  month
0  2023-06-27   2023-06-27  2023      6

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and 
calculates the difference between them in days, hours, and minutes using Pandas time delta. The 
program should prompt the user to enter the dates and display the result.

In [3]:
first_date = input("Enter first date in which you want to find the difference the days: ")
second_date = input("Enter second date in which you want to find the difference the days: ")
import pandas as pd

# Convert the input dates to pandas datetime objects
first_date = pd.to_datetime(first_date)
second_date = pd.to_datetime(second_date)

# Calculate the time difference
time_diff = second_date - first_date

# Extract days, hours, and minutes from the time difference
days = time_diff.days
hours = time_diff.seconds // 3600
minutes = (time_diff.seconds % 3600) // 60

# Display the result
print("Time difference: {} days, {} hours, {} minutes.".format(days, hours, minutes))

Enter first date in which you want to find the difference the days: 2022-06-12
Enter second date in which you want to find the difference the days: 2024-03-10
Time difference: 637 days, 0 hours, 0 minutes.

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified 
column to a categorical data type. The program should prompt the user to enter the file path, column 
name, and category order, and then display the sorted data.

In [ ]:
import pandas as pd

# Prompt the user to enter the file path
file_path = input("Enter the file path (CSV): ")

# Prompt the user to enter the column name
column_name = input("Enter the column name: ")

# Read the CSV file
data = pd.read_csv(file_path)

# Convert the specified column to categorical data type
data[column_name] = pd.Categorical(data[column_name])

# Prompt the user to enter the category order
category_order = input("Enter the category order (comma-separated values): ")
category_order = [cat.strip() for cat in category_order.split(',')]

# Set the category order for the column
data[column_name] = data[column_name].cat.set_categories(category_order)

# Sort the data based on the categorical column
sorted_data = data.sort_values(column_name)

# Display the sorted data
print(sorted_data)

Q10. Write a Python program that reads a CSV file containing sales data for different products and 
visualizes the data using a stacked bar chart to show the sales of each product category over time. The 
program should prompt the user to enter the file path and display the chart.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

# Prompt the user to enter the file path
file_path = input("Enter the file path (CSV): ")

# Read the CSV file
data = pd.read_csv(file_path)

# Convert the 'Date' column to datetime data type
data['Date'] = pd.to_datetime(data['Date'])

# Group the data by 'Date' and 'Category' and calculate the sum of 'Sales'
grouped_data = data.groupby(['Date', 'Category'])['Sales'].sum().unstack()

# Plot the stacked bar chart
fig, ax = plt.subplots()
grouped_data.plot(kind='bar', stacked=True, ax=ax)

# Set the chart title and axis labels
plt.title('Sales by Product Category over Time')
plt.xlabel('Date')
plt.ylabel('Sales')

# Show the chart
plt.show()

Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write 
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and 
displays the results in a table.
 The program should do the following
 Prompt the user to enter the file path of the CSV file containing the student data
 Read the CSV file into a Pandas DataFrame
 Calculate the mean, median, and mode of the test scores using Pandas tools
 Display the mean, median, and mode in a table

In [ ]:
import pandas as pd

# Prompt the user to enter the file path
file_path = input("Enter the file path (CSV): ")

# Read the CSV file into a DataFrame
data = pd.read_csv(file_path)

# Calculate the mean, median, and mode of the test scores
mean_score = data['Test Score'].mean()
median_score = data['Test Score'].median()
mode_score = data['Test Score'].mode().values[0]

# Create a table to display the results
result_table = pd.DataFrame({'Statistic': ['Mean', 'Median', 'Mode'],
                             'Test Score': [mean_score, median_score, mode_score]})

# Display the table
print(result_table)